import React from "react";
import ReactMarkdown from "react-markdown";

import Layout from "../components/layout";
import SEO from "../components/seo";

const IndexPage = ({ location }) => {
  return (
    <Layout location={location}>
      <SEO title="นโยบายส่วนบุคคล" />
      <ReactMarkdown className="container mx-auto my-6 px-2 md:px-8 markdown">
        {`
# นโยบายการคุ้มครองข้อมูลส่วนบุคคล เว็บไซต์นิทรรศการ "MDCU Open House"

สโมสรนิสิตคณะแพทยศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย จัดทำประกาศนโยบายฉบับนี้ เพื่อคุ้มครองข้อมูลส่วนบุคคลของผู้ใช้บริการเว็บไซต์นิทรรศการ "MDCU Open House" (mdcuopenhouse.docchula.com)

## 1. การเก็บรวบรวมข้อมูลส่วนบุคคล

การจัดเก็บรวบรวมข้อมูลส่วนบุคคลของผู้ใช้บริการเว็บไซต์นี้จะใช้วิธีการที่ชอบด้วยกฎหมายและเป็นธรรม และจัดเก็บข้อมูลเท่าที่จำเป็นเพื่อการจัดกิจกรรมนิทรรศการ และตามที่กฎหมายกำหนดเท่านั้น และจะมีการขอความยินยอมจากผู้ใช้บริการก่อนทำการเก็บรวบรวมและจัดเก็บข้อมูล เว้นแต่เป็นกรณีที่กฎหมายกำหนด กรณีที่จำเป็นต่อการให้บริการโดยปกติของคอมพิวเตอร์แม่ข่าย หรือในกรณีอื่น ๆ ตามที่กำหนดไว้ในนโยบายฉบับนี้ ซึ่งรวมถึง หมายเลขไอพี และประเภทของโปรแกรมเว็บเบราเซอร์

เว็บไซต์นี้มีการเชื่อมต่อกับ Facebook โดยสามารถดูนโยบายการคุ้มครองข้อมูลของ Facebook ได้ที่ https://www.facebook.com/policy

## 2. คุณภาพของข้อมูลส่วนบุคคล

สโมสรนิสิตฯ จะให้ความสำคัญถึงความถูกต้อง ครบถ้วน และเป็นปัจจุบันของข้อมูลที่จัดเก็บ

## 3. วัตถุประสงค์ในการจัดเก็บข้อมูลส่วนบุคคล

เว็บไซต์นี้มีการรวบรวม จัดเก็บ และใช้ข้อมูลส่วนบุคคล เพื่อวัตถุประสงค์ ดังนี้

1. เพื่อเป็นข้อมูลในการวัด-ประเมินผลการดำเนินงานของการจัดนิทรรศการ และปรับปรุงการดำเนินงาน
2. เพื่อเป็นหลักฐานการเยี่ยมชมในการแลกรับของรางวัลในงานนิทรรศการ
3. เพื่ออนุญาตการเข้าถึงข้อมูลต่าง ๆ เกี่ยวกับนิทรรศการ

ทั้งนี้ หากภายหลัง สโมสรนิสิตฯ มีการเปลี่ยนแปลงวัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคล สโมสรนิสิตฯ จะแจ้งให้ผู้ใช้บริการทราบและขอความยินยอม ทั้งนี้ สโมสรนิสิตฯ ได้กำหนดให้มีการบันทึกการแก้ไขเพิ่มเติมไว้เป็นหลักฐานด้วย

## 4. ข้อจำกัดในการนำข้อมูลส่วนบุคคลไปใช้

สโมสรนิสิตฯ จะไม่เปิดเผยข้อมูลส่วนบุคคลที่มีการจัดเก็บไว้ เว้นแต่ได้รับคำยินยอม หรือเพื่อปฏิบัติตามกฎหมายที่เกี่ยวข้อง

## 5. การรักษาความมั่นคงปลอดภัย

สโมสรนิสิตฯ มีมาตรการในการรักษาความมั่นคงปลอดภัยข้อมูลส่วนบุคคลอย่างเหมาะสม ซึ่งรวมทั้งการป้องกันการเข้าถึง-แก้ไข-สูญหายของข้อมูลส่วนบุคคลโดยมิชอบ และการบันทึกผู้เข้าชมเว็บไซต์ (Log)

## 6. การเปิดเผยเกี่ยวกับการดำเนินการ แนวปฏิบัติ และนโยบายที่เกี่ยวกับข้อมูลส่วนบุคคล

สโมสรนิสิตฯ จะเปิดเผยแนวนโยบาย และแนวปฏิบัติในการคุ้มครองข้อมูลส่วนบุคคลนี้ และหากมีการแก้ไขปรับปรุง สโมสรนิสิตฯ  จะดำเนินการเผยแพร่ผ่านเว็บไชต์นี้ 

กรณีที่ผู้ใช้บริการต้องการตรวจดูความมีอยู่ ลักษณะของข้อมูลส่วนบุคคล / วัตถุประสงค์ของการนำข้อมูลไปใช้ / ผู้ควบคุมและสถานที่ทำการของผู้ควบคุมข้อมูลส่วนบุคคล สามารถขอตรวจดูได้โดยติดต่อที่สโมสรนิสิตคณะแพทยศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย หรือผ่านทางอีเมล itdivision@docchula.com

## 7. การมีส่วนร่วมของเจ้าของข้อมูล

สโมสรนิสิตฯ  จะเปิดเผยรายละเอียดข้อมูลส่วนบุคคลต่อเมื่อได้รับคำร้องขอจากเจ้าของข้อมูล ผู้สืบสิทธิ ทายาท ผู้แทนโดยชอบธรรม หรือผู้พิทักษ์ตามกฎหมาย โดยการแจ้งการร้องขอเป็นลายลักษณ์อักษร และในกรณีที่เจ้าของข้อมูล ผู้สืบสิทธิ ทายาท ผู้แทนโดยชอบธรรม หรือผู้พิทักษ์ตามกฎหมาย มีการคัดค้านการจัดเก็บ ความถูกต้อง หรือการกระทำใด ๆ เช่น การแจ้งดำเนินการปรับปรุงแก้ไขข้อมูลส่วนบุคคลหรือลบข้อมูลส่วนบุคคล ฯลฯ สโมสรนิสิตฯ  จะดำเนินการบันทึกหลักฐานคำคัดค้านดังกล่าวไว้เป็นหลักฐานด้วย

## 8. ความรับผิดชอบของบุคคลซึ่งทำหน้าที่ควบคุมข้อมูลส่วนบุคคล

สโมสรนิสิตฯ  กำหนดให้ผู้เกี่ยวข้องซึ่งมีหน้าที่รับผิดชอบในการดูแลการจัดเก็บ การใช้ และการเปิดเผยข้อมูลส่วนบุคคลของผู้ใช้บริการ ต้องปฏิบัติตามนโยบายในการคุ้มครองข้อมูลส่วนบุคคล และมาตรการในการรักษาความมั่นคงปลอดภัยของระบบเทคโนโลยีสารสนเทศ
`}
      </ReactMarkdown>
    </Layout>
  );
};

export default IndexPage;
